package org.example

import com.google.gson.Gson

object Repository {
    val currentDataChunk = Gson().fromJson(
        "{\n" +
                " \"offers\": [\n" +
                "   {\n" +
                "     \"id\": \"near_vacancies\",\n" +
                "     \"title\": \"Вакансии рядом с вами\",\n" +
                "     \"link\": \"https://hh.ru/\"\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"level_up_resume\",\n" +
                "     \"title\": \"Поднять резюме в поиске\",\n" +
                "     \"button\": {\n" +
                "       \"text\": \"Поднять\"\n" +
                "     },\n" +
                "     \"link\": \"https://hh.ru/mentors?from\\u003dfooter_new\\u0026hhtmFromLabel\\u003dfooter_new\\u0026hhtmFrom\\u003dmain\\u0026purposeId\\u003d1\"\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"temporary_job\",\n" +
                "     \"title\": \"  Временная работа или подработка\",\n" +
                "     \"link\": \"https://hh.ru/\"\n" +
                "   },\n" +
                "   {\n" +
                "     \"title\": \"Полезные статьи и советы\",\n" +
                "     \"link\": \"https://hh.ru/articles?hhtmFrom\\u003dmain\"\n" +
                "   }\n" +
                " ],\n" +
                " \"vacancies\": [\n" +
                "   {\n" +
                "     \"id\": \"cbf0c984-7c6c-4ada-82da-e29dc698bb50\",\n" +
                "     \"lookingNumber\": 2,\n" +
                "     \"title\": \"UI/UX дизайнер\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Минск\",\n" +
                "       \"street\": \"улица Бирюзова\",\n" +
                "       \"house\": \"4/5\"\n" +
                "     },\n" +
                "     \"company\": \"Мобирикс\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Опыт от 1 до 3 лет\",\n" +
                "       \"text\": \"1–3 года\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-02-20\",\n" +
                "     \"isFavorite\": false,\n" +
                "     \"salary\": {\n" +
                "       \"full\": \"Уровень дохода не указан\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"полная занятость\",\n" +
                "       \"полный день\"\n" +
                "     ],\n" +
                "     \"appliedNumber\": 147,\n" +
                "     \"description\": \"Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами будет заниматься проектированием пользовательских интерфейсов внутренних и внешних продуктов компании.\",\n" +
                "     \"responsibilities\": \"- проектирование пользовательских сценариев и создание прототипов;\\n- разработка интерфейсов для продуктов компании (Web+App);\\n- работа над созданием и улучшением Дизайн-системы;\\n- взаимодействие с командами frontend-разработки;\\n- контроль качества внедрения дизайна;\\n- ситуативно: создание презентаций и других материалов на основе фирменного стиля компании\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Вакансия открыта?\",\n" +
                "       \"Какая оплата труда?\"\n" +
                "     ]\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"54a876a5-2205-48ba-9498-cfecff4baa6e\",\n" +
                "     \"lookingNumber\": 17,\n" +
                "     \"title\": \"UI/UX-дизайнер / Web-дизайнер / Дизайнер интерфейсов\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Казань\",\n" +
                "       \"street\": \"улица Чистопольская\",\n" +
                "       \"house\": \"20/10\"\n" +
                "     },\n" +
                "     \"company\": \"Шафигуллин Шакир\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Опыт от 1 до 3 лет\",\n" +
                "       \"text\": \"1–3 года\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-03-06\",\n" +
                "     \"isFavorite\": false,\n" +
                "     \"salary\": {\n" +
                "       \"short\": \"20 000 до 50 000 ₽\",\n" +
                "       \"full\": \"от 20 000 до 50 000 ₽ на руки\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"частичная занятость\",\n" +
                "       \"полный день\"\n" +
                "     ],\n" +
                "     \"description\": \"Мы разрабатываем мобильные приложения, web-приложения и сайты под ключ.\\n\\nНам в команду нужен UX/UI Designer!\",\n" +
                "     \"responsibilities\": \"- Разработка дизайна Web+App (обязательно Figma)\\n\\n- Работа над созданием и улучшением систем;\\n\\n- Взаимодействие с командами frontend-разработки и backend-разработки\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Как с вами связаться?\"\n" +
                "     ]\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"75c84407-52e1-4cce-a73a-ff2d3ac031b3\",\n" +
                "     \"title\": \"UX/UI Designer\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Казань\",\n" +
                "       \"street\": \"улица Пушкина\",\n" +
                "       \"house\": \"2\"\n" +
                "     },\n" +
                "     \"company\": \"Aston\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Опыт от 3 до 6 лет\",\n" +
                "       \"text\": \"3–6 лет\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-02-28\",\n" +
                "     \"isFavorite\": true,\n" +
                "     \"salary\": {\n" +
                "       \"full\": \"Уровень дохода не указан\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"полная занятость\",\n" +
                "       \"удаленная работа\"\n" +
                "     ],\n" +
                "     \"appliedNumber\": 11,\n" +
                "     \"description\": \"Мы – аутсорсинговая аккредитованная IT-компания Aston, разрабатываем программное обеспечение на заказ и оказываем услуги IT-аутсорсинга предприятиям, организациям и стартапам. Приоритетные направления – финансовые технологии, телеком, ритейл, недвижимость и другие. Среди наших клиентов – компании Тинькофф, Х5 Retail Group, Банки.ру, ВТБ Банк, Альфа Банк, Цифра и другие.\\n\\nЗаказчик входит в топ-10 российских банков по величине активов, кредитного портфеля, размеру средств, привлеченных от клиентов, и нормативного капитала.\\n\\nБанк активно развивает онлайн-сервисы и работает по стратегии Mobile first. В компании есть отдельное подразделение, в котором создаются digital-продукты и внедряются цифровые технологии.\",\n" +
                "     \"responsibilities\": \"- совместно с Product Owner определять бизнес-метрики, потребности клиентов банка, фиксировать их в формате задач и метрик успешности;\\n- изучать лучшие практики и недостатки аналогичных продуктов, проходить путь клиента и формулировать гипотезы решения задач вместе с продуктовой командой;\\n- создавать прототипы для проверки гипотез;\\n- передавать прототипы на Usability-тесты и контролировать их проведение;\\n- улучшать решения по результатам тестов и наблюдений;\\n- готовить чистовые макеты на основе компонентов дизайн-системы банка для передачи в разработку;\\n- создавать и описывать новые компоненты дизайн-системы по принятым в банке стандартам;\\n- отдавать на дизайн-чек макеты и проверять решения других дизайнеров;\\n- передавать макеты разработчикам и отвечать на возникающие в процессе разработки вопросы;\\n- проводить дизайн-ревью результата разработки и формулировать список замечаний для разработчиков;\\n- итеративно совершенствовать дизайн цифрового продукта на основе метрик и отзывов клиентов;\\n- участвовать в улучшении процессов центра компетенций продуктового дизайна.\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Какая оплата труда?\"\n" +
                "     ]\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"16f88865-ae74-4b7c-9d85-b68334bb97db\",\n" +
                "     \"lookingNumber\": 57,\n" +
                "     \"title\": \"Веб-дизайнер\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Казань\",\n" +
                "       \"street\": \"улица Пушкина\",\n" +
                "       \"house\": \"57\"\n" +
                "     },\n" +
                "     \"company\": \"Алабуга. Маркетинг и PR\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Без опыта\",\n" +
                "       \"text\": \"не требуется\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-03-02\",\n" +
                "     \"isFavorite\": false,\n" +
                "     \"salary\": {\n" +
                "       \"short\": \"от 60 000 ₽\",\n" +
                "       \"full\": \"от 60 000 ₽ до вычета налогов\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"частичная занятость\",\n" +
                "       \"полный день\"\n" +
                "     ],\n" +
                "     \"appliedNumber\": 7,\n" +
                "     \"responsibilities\": \"- Разработка новых сайтов, приложений, лэндингов;\\n- Создание и доработка прототипов готовых к сдаче в верстку;\\n- Взаимодействие с подрядчиками по разработке сайтов\\n- Доработка существующих сайтов;\\n- Проектирование интерфейсов, организация UI/UX-исследований;\\n- Взаимодействие с Frontend и Backend разработчиками, техническими специалистами;\\n- Работа с дизайн системой, её поддержание.\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Вакансия открыта?\",\n" +
                "       \"Какая оплата труда?\"\n" +
                "     ]\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"26f88856-ae74-4b7c-9d85-b68334bb97db\",\n" +
                "     \"lookingNumber\": 29,\n" +
                "     \"title\": \"Ведущий продуктовый дизайнер\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Минск\",\n" +
                "       \"street\": \"проспект Хасанова\",\n" +
                "       \"house\": \"15\"\n" +
                "     },\n" +
                "     \"company\": \"ПАО Ростелеком\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Опыт от 3 до 6 лет\",\n" +
                "       \"text\": \"3–6 лет\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-02-19\",\n" +
                "     \"isFavorite\": false,\n" +
                "     \"salary\": {\n" +
                "       \"full\": \"Уровень дохода не указан\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"полная занятость\",\n" +
                "       \"удаленная работа\"\n" +
                "     ],\n" +
                "     \"description\": \"Перед вами не просто вакансия. Перед вами — уникальные возможности, от которых вас отделяет всего один клик.\",\n" +
                "     \"responsibilities\": \"— Готовить макеты на основании прототипа и/или описания пользовательских сценариев;\\n— Анализировать бизнесовые и пользовательские требования, уточнять постановки от аналитиков и проектировщиков;\\n— Создавать графические и стилистические элементы для портала, приложений и промо страниц;\\n— Оптимизировать дизайн существующих интерфейсов;\\n— Осуществлять авторский контроль над исполнителями;\\n— Развивать существующую дизайн-систему и UI-киты;\\n— Помогать в подготовке продающих фичи презентаций.\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Вакансия открыта?\",\n" +
                "       \"Какая оплата труда?\"\n" +
                "     ]\n" +
                "   },\n" +
                "   {\n" +
                "     \"id\": \"15f88865-ae74-4b7c-9d81-b78334bb97db\",\n" +
                "     \"lookingNumber\": 1,\n" +
                "     \"title\": \"Product Designer\",\n" +
                "     \"address\": {\n" +
                "       \"town\": \"Минск\",\n" +
                "       \"street\": \"улица Побратимова\",\n" +
                "       \"house\": \"5\"\n" +
                "     },\n" +
                "     \"company\": \"TravelLine\",\n" +
                "     \"experience\": {\n" +
                "       \"previewText\": \"Опыт от 3 до 6 лет\",\n" +
                "       \"text\": \"3–6 лет\"\n" +
                "     },\n" +
                "     \"publishedDate\": \"2024-02-02\",\n" +
                "     \"isFavorite\": false,\n" +
                "     \"salary\": {\n" +
                "       \"full\": \"Уровень дохода не указан\"\n" +
                "     },\n" +
                "     \"schedules\": [\n" +
                "       \"полная занятость\",\n" +
                "       \"полный день\"\n" +
                "     ],\n" +
                "     \"appliedNumber\": 1,\n" +
                "     \"description\": \"В TravelLine мы разрабатываем единую функциональную Платформу для автоматизации процессов гостиничного бизнеса. Всё, что связано с онлайн-бронированием и управлением номерным фондом в отелях — это к нам. Ежемесячно через наши системы бронируют более 1,5 миллионов гостей.\\n\\nМы ищем коллегу в команду продуктовых дизайнеров на В2В продукт.\\nСейчас в нашей команде 10 продуктовых дизайнеров, которые занимаются В2В, В2С и В2Е продуктами.\\nВ начале пути у тебя будет наставник, который поможет в адаптации к новой команде.\",\n" +
                "     \"responsibilities\": \"- Проектировать интерфейс B2B продукта: сопровождать и улучшать текущие решения, поддерживать консистентность\\n\\n- Понимать потребности и боли пользователей, логику взаимодействия пользователя с продуктом, участвовать в этапе discovery\\n\\n- Создавать интерактивные прототипы\\n\\n- Проводить юзабилити-тестирования и ревью реализации решений\\n\\n- Работать внутри продуктовой команды: коммуницировать с дизайнерами, продакт и проджект менеджерами, аналитиками, разработчиками и тестировщиками.\",\n" +
                "     \"questions\": [\n" +
                "       \"Где располагается место работы?\",\n" +
                "       \"Какой график работы?\",\n" +
                "       \"Вакансия открыта?\",\n" +
                "       \"Какая оплата труда?\",\n" +
                "       \"Как с вами связаться?\"\n" +
                "     ]\n" +
                "   }\n" +
                " ]\n" +
                "}",
        DataChunk::class.java
    )
}
